In [1]:
a = 3 
b =2 
a + b

5

In [2]:

import pandas as pd
import numpy as np 
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago'],
    'Salary': [70000, 80000, 90000]
}
df = pd.DataFrame(data)
df

      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago   90000

In [3]:
# Group By 
# df.groupby('Name')  # Group by a column
# df.groupby('City')['Salary'].mean()  # Group by 'City' and calculate mean 'Salary'
# df
# create a dataframe with coulmn 'Categrory' , 'Store', 'Sales' , "Quantity" and Date
import pandas as pd
data = {
    'Category': ['Electronics', 'Electronics', 'Furniture', 'Furniture', 'Clothing', 'Clothing'],
    'Store': ['Store A', 'Store B', 'Store A', 'Store B', 'Store A', 'Store B'],
    'Sales': [1000, 1500, 2000, 2500, 3000, 3500],
    'Quantity': [5, 7, 10, 12, 15, 18],
    'Date': pd.date_range(start='2023-01-01', periods=6, freq='M')
}
df = pd.DataFrame(data)
df
# cat = df.groupby('Category')
# cat.sum()

C:\Users\HP\AppData\Local\Temp\ipykernel_10200\66204682.py:12: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  'Date': pd.date_range(start='2023-01-01', periods=6, freq='M')

      Category    Store  Sales  Quantity       Date
0  Electronics  Store A   1000         5 2023-01-31
1  Electronics  Store B   1500         7 2023-02-28
2    Furniture  Store A   2000        10 2023-03-31
3    Furniture  Store B   2500        12 2023-04-30
4     Clothing  Store A   3000        15 2023-05-31
5     Clothing  Store B   3500        18 2023-06-30